--[[
DATA : 2016 / 12 / 18
Piano Game
Author : JianYingLi
--]]

--=======================================================================================
--引入各種函式庫
--=======================================================================================
local widget = require( "widget" )

--=======================================================================================
--宣告各種全域變數
--=======================================================================================
_SCREEN = {
	WIDTH = display.contentWidth,
	HEIGHT = display.contentHeight
}
_SCREEN.CENTER = {
	X = display.contentCenterX,
	Y = display.contentCenterY
}

--=======================================================================================
--宣告各種區域變數
--=======================================================================================
local pianoKey -- 鋼琴白鍵
local pianoKeyB -- 鋼琴黑鍵
local wx = 0
local bx = 30


--=======================================================================================
--宣告各種區域函式
--=======================================================================================
local closeOpenBar

--=======================================================================================
--宣告與定義main()函式
--=======================================================================================
funMain = function (  )

	-- 建立一個子群組
	funInit()

	closeOpenBar( false )

end

--=======================================================================================
--定義其他函式
--=======================================================================================
--初始化函式，一般用於建立元件，設定初始值，部署元件等工作...
funInit = function ()

	-- 迴圈生成8個白鍵
	for w = 1 , 8 do
		pianoKey = display.newRect( wx , 160  , 67 , 320 )
		pianoKey:setFillColor( 1,1,1 )
		-- pianoKey.fill = {
		-- 	type = "image",
		-- 	filename = "images/icon.png",
		-- }
		wx = wx + 69
	end
	-- 迴圈生成5個黑鍵
	for b = 1 , 5 do
		-- 判斷第三個黑鍵增加x距離
		if b == 3 then
		bx = bx + 140
		else
		bx = bx + 70
		end
		-- 加上圖片在黑鍵裡面，並用遮罩效果
		pianoKeyB = display.newRect( bx , 100 , 67 , 200 )
		pianoKeyB:setFillColor( 0,0,0 )
		pianoKeyB.fill = {
			type = "image",
			filename = "images/field.png",
			}
	end

end

-- 分隔線 --------------------------------------------------
-- 關閉開啟手機功能欄
closeOpenBar = function ( isOpen )
	if ( isOpen ) then
		display.setStatusBar( display.TranslucentStatusBar )
	else
		display.setStatusBar( display.HiddenStatusBar )
	end
end

--=======================================================================================
--呼叫主函式
--=======================================================================================
funMain()

