-----------------------------------------------------------------------------------------
--
-- main.lua
--
-----------------------------------------------------------------------------------------
--[[
create()是切換到此場景時先被呼叫的地方，我們可以這裡加入button等場景需要的物件以及相對應的function，
show()是場景要開始真正運作的進入點，我們在這裡加入需要的執行動作，例如播放音樂等等，
hide()是場景要被切換時會呼叫，也就是要離開場景時，
destroy()是場景被remove時會呼叫

main.lua
我們也可以在main.lua裡加入display相關物件，
在這裡加入的物件，不管如何切換場景，它們都會出現在畫面上，
可以視它們為global objects
]]
--=======================================================================================
--引入各種函式庫
--=======================================================================================
display.setStatusBar( display.HiddenStatusBar )
local composer = require( "composer" )

--=======================================================================================
--宣告各種變數
--=======================================================================================
_SCREEN = {
	WIDTH = display.viewableContentWidth,
	HEIGHT = display.viewableContentHeight
}
_SCREEN.CENTER = {
	X = display.contentCenterX,
	Y = display.contentCenterY
}

local text

local init
local onClick
--=======================================================================================
--宣告與定義main()函式
--=======================================================================================
local main = function (  )
	init()
end

--=======================================================================================
--定義其他函式
--=======================================================================================
init = function()
	text = display.newText( "場景一" , 160 , 240 , native.systemFont , 30 )
	Runtime:addEventListener( "tap" , onClick )
end

onClick = function()
	local options = { effect = "fade" , time = 400 }
	composer.gotoScene( "scene1" , options )
	Runtime:removeEventListener( "tap" , onClick )
    text:removeSelf( )
	text = nil
end
--=======================================================================================
--呼叫主函式
--=======================================================================================
main()